Tools/Output/sysbench.log
sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Creating table 'sbtest1'...
Inserting 10000 records into 'sbtest1'
Creating a secondary index on 'sbtest1'...
Creating table 'sbtest2'...
Inserting 10000 records into 'sbtest2'
Creating a secondary index on 'sbtest2'...
Creating table 'sbtest3'...
Inserting 10000 records into 'sbtest3'
Creating a secondary index on 'sbtest3'...
Creating table 'sbtest4'...
Inserting 10000 records into 'sbtest4'
Creating a secondary index on 'sbtest4'...
Creating table 'sbtest5'...
Inserting 10000 records into 'sbtest5'
Creating a secondary index on 'sbtest5'...
Creating table 'sbtest6'...
Inserting 10000 records into 'sbtest6'
Creating a secondary index on 'sbtest6'...
Creating table 'sbtest7'...
Inserting 10000 records into 'sbtest7'
Creating a secondary index on 'sbtest7'...
Creating table 'sbtest8'...
Inserting 10000 records into 'sbtest8'
Creating a secondary index on 'sbtest8'...
Creating table 'sbtest9'...
Inserting 10000 records into 'sbtest9'
Creating a secondary index on 'sbtest9'...
Creating table 'sbtest10'...
Inserting 10000 records into 'sbtest10'
Creating a secondary index on 'sbtest10'...
sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Running the test with following options:
Number of threads: 1
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 1 tps: 1115.93 qps: 22333.57 (r/w/o: 15636.98/4463.73/2232.86) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 1 tps: 1191.53 qps: 23826.63 (r/w/o: 16677.44/4766.13/2383.06) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 1 tps: 1255.65 qps: 25110.01 (r/w/o: 17576.10/5022.60/2511.30) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 1 tps: 1285.45 qps: 25707.00 (r/w/o: 17994.30/5141.80/2570.90) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 1 tps: 1003.51 qps: 20081.24 (r/w/o: 14058.17/4016.05/2007.02) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 1 tps: 1013.08 qps: 20256.58 (r/w/o: 14180.10/4050.32/2026.16) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 1 tps: 1135.69 qps: 22710.83 (r/w/o: 15896.68/4542.77/2271.38) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 1 tps: 1073.72 qps: 21484.40 (r/w/o: 15038.08/4298.89/2147.44) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 1 tps: 1171.92 qps: 23431.48 (r/w/o: 16403.93/4683.71/2343.85) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            160076
        write:                           45736
        other:                           22868
        total:                           228680
    transactions:                        11434  (1143.31 per sec.)
    queries:                             228680 (22866.24 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0006s
    total number of events:              11434

Latency (ms):
         min:                                    0.69
         avg:                                    0.87
         max:                                    5.07
         95th percentile:                        0.00
         sum:                                 9995.11

Threads fairness:
    events (avg/stddev):           11434.0000/0.00
    execution time (avg/stddev):   9.9951/0.00

sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...
Dropping table 'sbtest9'...
Dropping table 'sbtest10'...