Tools/Output/sysbench.log
sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Creating table 'sbtest1'...
Inserting 10000 records into 'sbtest1'
Creating a secondary index on 'sbtest1'...
Creating table 'sbtest2'...
Inserting 10000 records into 'sbtest2'
Creating a secondary index on 'sbtest2'...
Creating table 'sbtest3'...
Inserting 10000 records into 'sbtest3'
Creating a secondary index on 'sbtest3'...
Creating table 'sbtest4'...
Inserting 10000 records into 'sbtest4'
Creating a secondary index on 'sbtest4'...
Creating table 'sbtest5'...
Inserting 10000 records into 'sbtest5'
Creating a secondary index on 'sbtest5'...
Creating table 'sbtest6'...
Inserting 10000 records into 'sbtest6'
Creating a secondary index on 'sbtest6'...
Creating table 'sbtest7'...
Inserting 10000 records into 'sbtest7'
Creating a secondary index on 'sbtest7'...
Creating table 'sbtest8'...
Inserting 10000 records into 'sbtest8'
Creating a secondary index on 'sbtest8'...
Creating table 'sbtest9'...
Inserting 10000 records into 'sbtest9'
Creating a secondary index on 'sbtest9'...
Creating table 'sbtest10'...
Inserting 10000 records into 'sbtest10'
Creating a secondary index on 'sbtest10'...
sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Running the test with following options:
Number of threads: 1
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 1 tps: 1181.39 qps: 23643.71 (r/w/o: 16553.39/4726.54/2363.77) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 1 tps: 1206.28 qps: 24128.65 (r/w/o: 16887.97/4828.12/2412.57) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 1 tps: 1278.66 qps: 25562.11 (r/w/o: 17894.18/5110.62/2557.31) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 1 tps: 1308.24 qps: 26158.87 (r/w/o: 18309.41/5232.97/2616.49) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 1 tps: 1314.05 qps: 26294.04 (r/w/o: 18409.73/5256.21/2628.11) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 1 tps: 1308.95 qps: 26168.01 (r/w/o: 18314.30/5235.80/2617.90) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 1 tps: 1313.30 qps: 26265.01 (r/w/o: 18385.21/5253.20/2626.60) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 1 tps: 1313.00 qps: 26262.03 (r/w/o: 18384.02/5252.01/2626.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 1 tps: 1321.70 qps: 26446.05 (r/w/o: 18513.83/5288.81/2643.41) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            180068
        write:                           51448
        other:                           25724
        total:                           257240
    transactions:                        12862  (1286.04 per sec.)
    queries:                             257240 (25720.86 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0010s
    total number of events:              12862

Latency (ms):
         min:                                    0.69
         avg:                                    0.78
         max:                                    5.00
         95th percentile:                        0.00
         sum:                                 9996.38

Threads fairness:
    events (avg/stddev):           12862.0000/0.00
    execution time (avg/stddev):   9.9964/0.00

sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...
Dropping table 'sbtest9'...
Dropping table 'sbtest10'...